shreyash-b/esp-agents-firmware/examples/matter_controller/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

# Format
CONFIG_BOOTLOADER_LOG_COLORS=y

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y

# App Network Wi-Fi Provisioning
CONFIG_APP_NETWORK_ASYNCHRONOUS_CONNECTION=y
CONFIG_APP_WIFI_PROV_COMPAT=n

# Load Multiple Wake Words (WakeNet9)
CONFIG_SR_WN_WN9_HILEXIN=y
CONFIG_SR_WN_WN9_HIESP=y

# ESP System Settings
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Wi-Fi
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# Log
CONFIG_LOG_VERSION_2=y
CONFIG_LOG_COLORS=y

# lwip
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64

# Websocket
CONFIG_WS_BUFFER_SIZE=2048
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_ESP_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_USE_MALLOC=y

# Octal PSRAM 120 MHz is an experimental feature
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# freertos
CONFIG_FREERTOS_HZ=1000

# System
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# mbedtls
# CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# BLE
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# Application Rollback
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ESP RainMaker Config
CONFIG_ESP_RMAKER_ASSISTED_CLAIM=y
CONFIG_ESP_RMAKER_ENABLE_CHALLENGE_RESPONSE=y

# For ESP-MQTT
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_OUTBOX_DATA_ON_EXTERNAL_MEMORY=y
CONFIG_MQTT_TASK_STACK_SIZE=8192

# LVGL
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_DEF_REFR_PERIOD=10
CONFIG_LV_USE_FONT_COMPRESSED=n
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_USE_IMGFONT=y

# Disable softAP to save code size
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Enable client only matter controller
CONFIG_ESP_CLIENT_ONLY_MATTER_CONTROLLER=y

# Alloc Matter memory from external
CONFIG_ESP_MATTER_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_CHIP_MEM_ALLOC_MODE_EXTERNAL=y

# mbedtls
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_HKDF_C=y

# Use platform mdns and alloc memory from psram
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_MDNS_MEMORY_ALLOC_SPIRAM=y

# Disable Matter server and enable Controller
CONFIG_ESP_MATTER_ENABLE_MATTER_SERVER=n
CONFIG_ENABLE_CHIP_CONTROLLER_BUILD=y
CONFIG_ESP_MATTER_CONTROLLER_ENABLE=y
CONFIG_ESP_MATTER_COMMISSIONER_ENABLE=n

# Disable network commissioning driver
CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER=n
CONFIG_THREAD_NETWORK_COMMISSIONING_DRIVER=n

# Use custom credentials issuer
CONFIG_CUSTOM_OPERATIONAL_CREDS_ISSUER=y

# Disable Matter over BLE
CONFIG_ENABLE_CHIPOBLE=n
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

# Increase IPv6 address Number
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6

# Increase udp endpoints number
CONFIG_NUM_UDP_ENDPOINTS=16

# Enable lwIP route hooks and autoconfig
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Temporary Fix for Timer Overflows
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3120

# Increase system event queue size
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=64

# Set mmap file name length
CONFIG_MMAP_FILE_NAME_LENGTH=32

# Config for ram optimization
CONFIG_EVENT_LOGGING_CRIT_BUFFER_SIZE=256
CONFIG_EVENT_LOGGING_INFO_BUFFER_SIZE=256
CONFIG_EVENT_LOGGING_DEBUG_BUFFER_SIZE=256
CONFIG_MAX_EVENT_QUEUE_SIZE=20
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=1
CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY=y

# Disable openthread cli
CONFIG_OPENTHREAD_CLI=n

# Show task running time status
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Disable openthread cli
CONFIG_OPENTHREAD_CLI=n

# Pin gfx emote task to core 0
CONFIG_APP_EMOTE_TASK_CORE_ID=0

# Configure default Agent ID
CONFIG_AGENT_SETUP_DEFAULT_AGENT_ID="matter_controller"

CONFIG_AGENT_SETUP_RAINMAKER_DEVICE_NAME="Matter Controller"
